{
  "id": "base1-064",
  "name": "Starmie",
  "number": 64,
  "set": {
    "id": "base1",
    "name": "Base Set",
    "series": "Original",
    "releaseDate": "1999-01-09",
    "totalCards": 102
  },
  "cardType": "pokemon",
  "supertype": "Pokemon",
  "subtypes": ["Stage 1"],
  "rarity": "Common",
  "hp": 60,
  "types": ["Water"],
  "stage": "Stage 1",
  "evolvesFrom": "Staryu",
  "evolvesTo": [],
  "abilities": [],
  "attacks": [
    {
      "name": "Recover",
      "cost": ["Water", "Water"],
      "convertedEnergyCost": 2,
      "damage": "",
      "baseDamage": 0,
      "text": "Discard 1 Water Energy card attached to Starmie in order to use this attack. Remove all damage counters from Starmie."
    },
    {
      "name": "Star Freeze",
      "cost": ["Water", "Colorless", "Colorless"],
      "convertedEnergyCost": 3,
      "damage": "20",
      "baseDamage": 20,
      "text": "Flip a coin. If heads, the Defending Pokémon is now Paralyzed."
    }
  ],
  "weakness": {
    "type": "Lightning",
    "value": "x2"
  },
  "resistance": null,
  "retreatCost": ["Colorless"],
  "convertedRetreatCost": 1,
  "pokedex": {
    "nationalNumber": 121,
    "category": "Mysterious Pokemon",
    "height": "3' 7\"",
    "weight": "176 lbs.",
    "level": 28
  },
  "flavorText": "Its central core glows with the seven colors of the rainbow. Some people value this core as a gem.",
  "illustrator": "Keiji Kinebuchi",
  "imageUrl": "064_starmie.jpg",
  "legality": {
    "standard": false,
    "expanded": false,
    "unlimited": true
  },
  "gameplay": {
    "role": "Tank",
    "strengths": [
      "Recover allows complete healing, providing exceptional sustainability",
      "Star Freeze offers paralysis disruption with decent 20 damage",
      "Low retreat cost of 1 provides excellent mobility",
      "60 HP is solid for a common Stage 1 Pokemon",
      "Strong against Fire-type Pokemon in the format"
    ],
    "weaknesses": [
      "Recover requires discarding a Water Energy, limiting long-term viability",
      "Star Freeze's 3 Energy cost is expensive for only 20 damage",
      "Lightning weakness is significant against popular Electric Pokemon",
      "No resistance to help with defensive matchups",
      "Paralysis effect relies on coin flip, making it unreliable"
    ],
    "synergies": [
      "Rain Dance Blastoise allows easy Energy reattachment after using Recover",
      "Energy Retrieval can return discarded Water Energy to hand for reuse",
      "Super Energy Removal combined with Star Freeze paralysis creates lock strategies",
      "Defender can reduce incoming damage between Recover uses"
    ],
    "counters": [
      "Electabuzz - Lightning weakness and high damage overcome healing",
      "Zapdos - Can deal massive damage that healing cannot keep up with",
      "Energy removal decks - Cannot Recover without Water Energy"
    ]
  }
}
