{
  "id": "jungle-001",
  "name": "Clefable",
  "number": 1,
  "set": {
    "id": "jungle",
    "name": "Jungle",
    "series": "Original",
    "releaseDate": "1999-06-16",
    "totalCards": 64
  },
  "cardType": "pokemon",
  "supertype": "Pokemon",
  "subtypes": ["Stage 1"],
  "rarity": "Rare Holo",
  "hp": 70,
  "types": ["Colorless"],
  "stage": "Stage 1",
  "evolvesFrom": "Clefairy",
  "evolvesTo": [],
  "abilities": [],
  "attacks": [
    {
      "name": "Metronome",
      "cost": ["Colorless"],
      "convertedEnergyCost": 1,
      "damage": "",
      "baseDamage": 0,
      "text": "Choose 1 of the Defending Pokémon's attacks. Metronome copies that attack except for its Energy costs and anything else required in order to use that attack, such as discarding Energy cards. (No matter what type the Defending Pokémon is, Clefable's type is still Colorless.)",
      "effect": {
        "effectType": "special",
        "copyAttack": true,
        "ignoresEnergyCost": true,
        "ignoresInOrderToCosts": true,
        "maintainsOwnType": true
      }
    },
    {
      "name": "Minimize",
      "cost": ["Colorless", "Colorless"],
      "convertedEnergyCost": 2,
      "damage": "",
      "baseDamage": 0,
      "text": "All damage done by attacks to Clefable during your opponent's next turn is reduced by 20 (after applying Weakness and Resistance).",
      "effect": {
        "effectType": "damage_reduction",
        "reduction": 20,
        "duration": "opponent_next_turn",
        "timing": "after_weakness_resistance"
      }
    }
  ],
  "weakness": {
    "type": "Fighting",
    "value": "x2"
  },
  "resistance": {
    "type": "Psychic",
    "value": "-30"
  },
  "retreatCost": ["Colorless", "Colorless"],
  "convertedRetreatCost": 2,
  "pokedex": {
    "category": "Fairy Pokemon",
    "height": "4' 3\"",
    "weight": "88 lbs",
    "nationalNumber": 36,
    "level": 34
  },
  "flavorText": "A timid Fairy Pokémon that is rarely seen. It will run and hide the moment it senses people.",
  "illustrator": "Mitsuhiro Arita",
  "imageUrl": "001_clefable.jpg",
  "legality": {
    "standard": false,
    "expanded": false,
    "unlimited": true
  },
  "gameplay": {
    "role": "Attacker",
    "strengths": [
      "Metronome can copy any attack for just 1 energy",
      "Can use opponent's powerful attacks without energy cost requirements",
      "Ignores 'in order to' costs like discarding energy",
      "Minimize provides damage reduction for survivability",
      "Psychic resistance is useful against Psychic-heavy metagames",
      "Colorless typing means it fits in any deck"
    ],
    "weaknesses": [
      "70 HP is relatively low for a Stage 1",
      "Fighting weakness is dangerous against Hitmonchan decks",
      "Metronome is situational - depends on opponent's attacks",
      "Two retreat cost can be awkward",
      "Requires evolution setup"
    ],
    "synergies": [
      "Double Colorless Energy - powers up both attacks efficiently",
      "Scoop Up - reuse Clefable after taking damage",
      "Pokemon Center - heal damage from Minimize stalling",
      "Clefairy (Base Set) - for evolution"
    ],
    "counters": [
      "Hitmonchan - Fighting type hits weakness hard",
      "Machamp - Fighting type with high damage",
      "Pokemon with weak attacks - Metronome loses value",
      "Gust of Wind - force out before setup"
    ]
  },
  "competitiveHistory": "Clefable from Jungle was a unique and versatile card that saw play in various deck strategies. Its Metronome attack allowed it to copy powerful attacks like Charizard's Fire Spin without paying the energy discard cost, making it a potent tech card. However, it was not a dominant meta presence due to its reliance on the opponent having strong attacks to copy. The card was popular in casual play and saw occasional tournament use as a surprise tech option.",
  "rulings": [
    {
      "ruling": "Metronome copies the attack exactly, but any self-referencing text (like 'Chansey does 80 damage to itself') uses Clefable's name instead.",
      "source": "WotC Rulings"
    },
    {
      "ruling": "Metronome ignores energy costs and anything required 'in order to' use the attack (like Charizard's Fire Spin discard), but does NOT ignore conditions without 'in order to' text.",
      "source": "WotC Rulings"
    },
    {
      "ruling": "For attacks with variable damage based on attached energy (like Water Gun or Hydro Pump), Clefable must have the appropriate energy attached beyond the Metronome cost to gain the bonus damage.",
      "source": "WotC Rulings"
    },
    {
      "ruling": "Clefable's type remains Colorless regardless of what attack it copies - it does not become the Defending Pokemon's type.",
      "source": "WotC Rulings"
    },
    {
      "ruling": "Metronome can only copy attacks, not Pokemon Powers or Abilities.",
      "source": "WotC Rulings"
    }
  ]
}
